In [2]:
df={'name': ['karthick','jay','naveen','clinton','aravind'],
      'age': [24,32,22,24,24],
      'native': ['chn','dgl','erode','madurai','kerala']}

In [41]:
import pandas as pd
import numpy as np

In [4]:
mydf=pd.DataFrame(df,dtype=object)

In [5]:
mydf

       name age   native
0  karthick  24      chn
1       jay  32      dgl
2    naveen  22    erode
3   clinton  24  madurai
4   aravind  24   kerala

In [6]:
type(mydf)

pandas.core.frame.DataFrame

In [7]:
mydf['name'].replace({'jay':'jayaseelan'})

0      karthick
1    jayaseelan
2        naveen
3       clinton
4       aravind
Name: name, dtype: object

In [8]:
type(mydf['age'])

pandas.core.series.Series

In [9]:
mydf['name & native']= mydf['name'] + ' ' + mydf['native']

In [10]:
mydf.dtypes

name             object
age              object
native           object
name & native    object
dtype: object

In [11]:
mydf['age']= mydf['age'].apply(str)

In [12]:
mydf.dtypes

name             object
age              object
native           object
name & native    object
dtype: object

In [13]:
mydf['name & age']= mydf['name'] + ' ' + mydf['age']

In [14]:
#mydf.astype('str').dtypes['age']

In [15]:
mydf.head()

       name age   native    name & native   name & age
0  karthick  24      chn     karthick chn  karthick 24
1       jay  32      dgl          jay dgl       jay 32
2    naveen  22    erode     naveen erode    naveen 22
3   clinton  24  madurai  clinton madurai   clinton 24
4   aravind  24   kerala   aravind kerala   aravind 24

In [16]:
mydf.drop(columns=['name & age','name & native'])

#mydf.drop(columns=['name & age','name & native'],inplace=True)

       name age   native
0  karthick  24      chn
1       jay  32      dgl
2    naveen  22    erode
3   clinton  24  madurai
4   aravind  24   kerala

In [17]:
mydf.drop(columns=['name','native'],inplace=True)

In [18]:
mydf

  age    name & native   name & age
0  24     karthick chn  karthick 24
1  32          jay dgl       jay 32
2  22     naveen erode    naveen 22
3  24  clinton madurai   clinton 24
4  24   aravind kerala   aravind 24

In [19]:
mydf['name & native'].str.split(' ',expand=True)

          0        1
0  karthick      chn
1       jay      dgl
2    naveen    erode
3   clinton  madurai
4   aravind   kerala

In [20]:
mydf[['name','native']]=mydf['name & native'].str.split(' ',expand=True)

In [21]:
mydf.insert(1,'full','aaa')

In [22]:
mydf

  age full    name & native   name & age      name   native
0  24  aaa     karthick chn  karthick 24  karthick      chn
1  32  aaa          jay dgl       jay 32       jay      dgl
2  22  aaa     naveen erode    naveen 22    naveen    erode
3  24  aaa  clinton madurai   clinton 24   clinton  madurai
4  24  aaa   aravind kerala   aravind 24   aravind   kerala

In [23]:
mydf.drop(columns='full',inplace=True)

In [24]:
mydf

  age    name & native   name & age      name   native
0  24     karthick chn  karthick 24  karthick      chn
1  32          jay dgl       jay 32       jay      dgl
2  22     naveen erode    naveen 22    naveen    erode
3  24  clinton madurai   clinton 24   clinton  madurai
4  24   aravind kerala   aravind 24   aravind   kerala

In [25]:
mydf=mydf.append({'name':'sunny'},ignore_index=True)

In [26]:
mydf.drop(columns=['name & native','name & age'],inplace=True)

In [27]:
mydf

   age      name   native
0   24  karthick      chn
1   32       jay      dgl
2   22    naveen    erode
3   24   clinton  madurai
4   24   aravind   kerala
5  NaN     sunny      NaN

In [28]:
df={'name': ['dani','adribitoni','kendra'],
      'age': [27,28,30],
      'native': ['uk','usa','swiz']}

In [29]:
mydf2=pd.DataFrame(df)

In [30]:
mydf2

         name  age native
0        dani   27     uk
1  adribitoni   28    usa
2      kendra   30   swiz

In [31]:
mydf=mydf.append(mydf2,ignore_index=True)

In [32]:
mydf

   age        name   native
0   24    karthick      chn
1   32         jay      dgl
2   22      naveen    erode
3   24     clinton  madurai
4   24     aravind   kerala
5  NaN       sunny      NaN
6   27        dani       uk
7   28  adribitoni      usa
8   30      kendra     swiz

In [33]:
mydf.drop(index=mydf[mydf['native']=='usa'].index,inplace=True)

In [34]:
mydf

   age      name   native
0   24  karthick      chn
1   32       jay      dgl
2   22    naveen    erode
3   24   clinton  madurai
4   24   aravind   kerala
5  NaN     sunny      NaN
6   27      dani       uk
8   30    kendra     swiz

In [35]:
mydf.rename(index={8:7},inplace=True)

In [36]:
mydf

   age      name   native
0   24  karthick      chn
1   32       jay      dgl
2   22    naveen    erode
3   24   clinton  madurai
4   24   aravind   kerala
5  NaN     sunny      NaN
6   27      dani       uk
7   30    kendra     swiz

### part7- sorting rows

In [37]:
mydf.sort_values(by=['name','age'],ascending=[False,True],inplace=True)

In [38]:
mydf

   age      name   native
5  NaN     sunny      NaN
2   22    naveen    erode
7   30    kendra     swiz
0   24  karthick      chn
1   32       jay      dgl
6   27      dani       uk
3   24   clinton  madurai
4   24   aravind   kerala

In [39]:
mydf.sort_index()

   age      name   native
0   24  karthick      chn
1   32       jay      dgl
2   22    naveen    erode
3   24   clinton  madurai
4   24   aravind   kerala
5  NaN     sunny      NaN
6   27      dani       uk
7   30    kendra     swiz

### part9- cleaning data and missing value

In [42]:
#mydf=pd.DataFrame(df,dtype=object)

mydf.replace('NA',np.nan)
mydf.replace('Missing',np.nan)

   age      name   native
5  NaN     sunny      NaN
2   22    naveen    erode
7   30    kendra     swiz
0   24  karthick      chn
1   32       jay      dgl
6   27      dani       uk
3   24   clinton  madurai
4   24   aravind   kerala